---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Size
source: html/5603faa8-66a9-be04-7890-c06ee3b7ddba.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSet.Size Property

Returns the number of correction factors that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```